app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("color", "created_at", "email", "fName", "lName", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "fName" = ?, "lName" = ?, "color" = ?, "updated_at" = ? WHERE "addresses"."id" = 5  [["fName", "Oih"], ["lName", "O;j"], ["color", "green"], ["updated_at", Fri, 11 Oct 2013 01:42:56 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address.destroy